{
  "about": {
    "description": "I am a web developer, cartographer and graphic designer. I have an innate passion for collecting, visualizing and analyzing geospatial data as a means to understand the environment and the people in it. Currently working at Esri Inc., I develop, prototype and improve the ArcGIS API for JavaScript and ArcGIS Online to empower people with stronger and better web-based data visualization tools. My hobbies are: travel, biking, hiking, reading and making maps.",
    "photo": "images/profile.jpg"
  },
  "portfolio": [
    {
      "title": "Expanding the Capacity of Web Mapping",
      "type": "Advancing geospatial data visualization technology with <a href='http://www.esri.com/' target='_blank'>Esri, Inc.</a>",
      "description": "<p>\"Let geographic data tell stories via the Internet\" is this project's goal. As world-wide web becomes the primary media of maps and geographic information, how should traditional maps and cartography evolve to meet the emerging needs and challenges of web mapping?</p><p>Now dot density, proportional symbol, color ramp mapping are all available in the <a href='http://developers.arcgis.com/en/javascript/' target='_blank'>ArcGIS API for JavaScript</a>. Rather than just migrating everything in conventional cartography from papers to browsers, we explored new concepts, new workflows and new visual effects, by which web developers can convey new messages with powerful mapping tools.</p>Demos:<ul><li><a href='vector.html' target='_blank'>One dataset, multiple ways to visualize</a></li><li><a href='vector.html' target='_blank'>Scale-dependent dot density map</a></li><li><a href='vector.html' target='_blank'>Choropleth map without class breaks</a></li></ul>",
      "name": "vector",
      "demo": "images",
      "images": [
        {
          "src": "images/vector.png",
          "url": "vector.html"
        }
      ]
    },
    {
      "title": "Visualization from Scratch: Air Pollutants Mapping",
      "type": "Beginning with collecting first-hand air quality data in the field",
      "description": "<p>Air pollution mapping requires interpolation from point data. Instead of obtaining observations from existing monitoring stations, in this project we mapped air pollution from scratch - that is, we designed a monitoring network where the distribution of stations is optimized, went into the field to collect first-hand data, and explored the best way to visualize the data. Works included spatial optimization algorithm, experiment design, field particulate matter measurement, and visualization.</p><p>This project, which was proposed and coordinated by me, ultimately involved a interdisciplinary and collaborative effort of two professors and four graduate students with background in GIS, environmental science, physics, etc. It was awarded by Geller's Research Grant at <a href='http://www.clarku.edu/index.cfm' target='_blank'>Clark University</a>.</p><ul><li>Check out <a href='images/air1.png' title='air1' data-dialog>this slide show</a> for a brief project overview</li><li><a href='files/AirQuality_Poster4Research.pdf' target='_blank'>Conference poster</a></li><li><a href='files/Mapping the Concentration of Ambient Air Pollutants for Central Massachusetts.pdf' target='_blank'>Full project report</a></li></ul>",
      "name": "air",
      "demo": "gallery",
      "length": 6,
      "format": "png"
    },
    {
      "title": "AfricaMap",
      "type": "Web-based geospatial data visualization in collaboration with the <a href='http://worldmap.harvard.edu/africamap' target='_blank'>Center for Geographic Analysis, Harvard University</a>",
      "description": "<p><a href='http://worldmap.harvard.edu/africamap' target='_blank'>AfricaMap</a> is an open-source web mapping platform designated for archiving, visualizing and integrating geospatial statistics particularly for Africa. One can easily find statistics from various organizations and governments, but <i>how do we fit them together in one single platform?</i></p><p>As a GIS analyst at <a href='http://gis.harvard.edu/icb/icb.do' target='_blank'>Center for Geographic Analysis (CGA), Harvard University</a>, I worked with African-Art-and-Architecture historian <a href='http://aaas.fas.harvard.edu/directory/faculty/suzanne-p-blier' target='_blank'>Dr. Suzanne P. Blier</a> to retrieve statistics from various sources, and explored the options to make these number \"visible\" on map. To handle data in various formats and qualities, I employed my fimilarity with data syntax and skills in programming for text processing to handle the data effectively and accurately. This is an ongoing project and all results are available at http://worldmap.harvard.edu/africamap.</p><ul><li><a href='http://worldmap.harvard.edu/africamap' target='_blank'>AfricaMap</a></li><li><a href='http://www.neh.gov/divisions/odh/grant-news/announcing-6-digital-humanities-implementation-grant-awards-july-2013' target='_blank'>Announcing 6 Digital Humanities Implementation Grant Awards (July 2013)</a></li></ul>",
      "name": "africa",
      "demo": "images",
      "images": [
        {
          "src": "images/africa.png",
          "url": "http://worldmap.harvard.edu/africamap/"
        }
      ]
    },
    {
      "title": "GIS off the Shore: Eelgrass Mapping",
      "type": "Getting GIS on board with the <a href='http://www.maine.gov/dmr/index.htm' target='_blank'>Maine Department of Marine Resources</a>",
      "description": "<p>Eelgrass (<i>Zostera</i>) is an vital species in coastal ecosystems. It provides nutritions for many shallow ocean animals, and consequently sustains the fishery economy in the state of Maine. The goal of <a href='http://www.maine.gov/dmr/rm/eelgrass/index.htm' target='_blank'>eelgrass mapping</a> is to investigate, monitor and visualize eelgrass distribution.</p><p>Before entering the field, potential eelgrass patches were identified on low-tide aerial imagery and digitized in ArcGIS. While in the field, we drove a boat, navigated by ArcPad to visit every location we identified, and recorded the actual condition with notes, GPS tracklogs, photos and videos. After the field work, the data collected were summarized and released as public-accessible information in a web mapping application.</p><ul><li>Click any pictures on the right for a brief project overview</li></ul>",
      "name": "eelgrass",
      "demo": "gallery",
      "length": 6,
      "format": "png"
    },
    {
      "title": "Web GIS Crowd-sourcing",
      "type": "Developing interactive, collaborative web mapping applications",
      "description": "<p>Internet provides an effective way for multiple people to contribute geospatial data to one database. I participated in two crowd-sourcing GIS projects.</p><p><b>Maine Elver Map</b> was designed for marine patrol officers to report locations where illegal harvesting of elvers (young eels) were found. It successfully gathered 85 locations reported by about 10 officers. It employed Google Maps API and Google Fusion Table to provide a user interface and a publicly accessible database. Any input data was immediately reviewed by administrators via email to ensure the quality of the data.</p><p><a href='http://www.qiantangriver.org/' target='_blank'>QianTang River Map</a> was built to gather succeptible water pollution activities along the river. This project was initiated by <a href='http://www.greenzj.com/' target='_blank'>Green Zhejiang</a>, an environmental protection NGO in China. I worked as the primary technical lead to implement the system. Built upon <a href='http://www.ushahidi.com/' target='_blank'>Ushahidi's CrowdMap</a> platform, it leverages open-source tools to provide a zero-cost and easy-to-use solution to the NGO's need for crowd-sourcing.</p>",
      "name": "crowdsource",
      "demo": "images",
      "images": [
        {
          "src": "images/crowdsource1.png",
          "url": ""
        },{
          "src": "images/crowdsource2.png",
          "url": "http://www.qiantangriver.org/"
        }
      ]
    },
    {
      "title": "When Something is Built...",
      "type": "3D terrian visualization of prospective constructions",
      "description": "<p>In the beginning of the 21st century, Taiwan government proposed several \"mega projects\", including a highway crossing a 10,000-ft mountain ridge, a 4000-acre artificial reservoir for industrial water supply, etc.</p><p>To simulate these projects' impact on the landscapes, I independently created 12 3-D visualization scenes to give the public a chance to \"preview\" the changed landscapes when the construction is complete. These scenes were made by scanning and georeferencing maps from the project plans, retrieving Google's sattelite imagery, overlaying data with digital terrain model (DTM) in ArcScene, and post-export editing with Corel PhotoImpact.</p>",
      "name": "construction",
      "demo": "gallery",
      "length": 10,
      "format": "jpg"
    },
    {
      "title": "\"Bridge\" the Green Gap",
      "type": "Landscape Design",
      "description": "Coming soon"
    }
  ],
  "resume": {
    "education": [
      {
        "school": "Clark University",
        "location": "Worcester, MA",
        "time": "2010-2012",
        "degree": "Master of Science",
        "major": "Geographic Information Science for Development and Environment",
        "description": [
          "GPA: <b>4.03</b>/4.00",
          "Web mapping, participatory GIS, air pollution mapping, spatial epidemiology, spatial statistics"
        ]
      },
      {
        "school": "National Taiwan University",
        "location": "Taipei, Taiwan",
        "time": "2005-2009",
        "degree": "Bachelor of Science",
        "major": "Geography (with a minor in sociology)",
        "description": [
          "GPA: <b>3.96</b>/4.00 (or 89.5/100; ranked 1st in a class of 36)",
          "Focus: Cartography, GIS, urban geography, spatiotemporal analysis"
        ]
      }
    ],
    "profession": [
      {
        "organization": "Esri Inc.",
        "position": "Product Engineer",
        "location": "Redlands, CA",
        "time": "2012-present",
        "description": [
          "Developed and tested ArcGIS API for JavaScript (v3.1 - v3.8), ArcGIS.com.",
          "Prototyped and documented JavaScript applications for ArcGIS users."
        ]
      },
      {
        "organization": "Esri Inc.",
        "position": "Intern",
        "location": "Redlands, CA",
        "time": "2012",
        "description": [
          "Tested ArcGIS API for JavaScript v3.0 and ArcGIS.com."
        ]
      },
      {
        "organization": "Center for Geographic Analysis, Harvard University",
        "position": "GIS Analyst",
        "location": "Cambridge, MA",
        "time": "2011-2012",
        "description": [
          "Visualized world demographic and religious data on the WorldMap web mapping platform.",
          "Automating the process of parsing and integrating data from multiple sources using Python script."
        ]
      },
      {
        "organization": "Maine Department of Marine Resources",
        "position": "GIS Technician",
        "location": "Boothbay Harbor, ME",
        "time": "2011",
        "description": [
          "Used Trimble GeoExplorer 2008 and ArcPad 10.0 to validate the accuracy of seagrass maps (groundtruthing).",
          "Developed an API-based web map application for the Maine Marine Patrol officers to report the locations of young eel harvesting activities online.",
          "Managed governmental spatial data of the government among multiple File Geodatabase (FGDB) and ArcSDE data servers."
        ]
      },
      {
        "organization": "National Children's Study",
        "position": "Research Assistant",
        "location": "Worcester, MA",
        "time": "2011",
        "description": [
          "Visualized statistics (US Census and American Community Survey) and established spatial database for study area.",
          "Integrated GPS tracker, Garmin application, and Google Earth to provide dynamic map for field investigation."
        ]
      },
      {
        "organization": "GISDE Lab., Clark University",
        "position": "GIS Lab Manager",
        "location": "Worcester, MA",
        "time": "2011",
        "description": [
          "Provided technical support (desktop, printer, and GIS software) for 40 master's students.",
          "Collected and updated the information of GIS conferences, jobs, and resources; sustained a GIS resource website."
        ]
      },
      {
        "organization": "Map and Multimedia Lab., National Taiwan University",
        "position": "Cartographer and Map Editor",
        "location": "Taipei, Taiwan",
        "time": "2008-2009",
        "description": [
          "Illustrated and edited maps for an annual map calendar (print volume: 3,000) to promote geographical education.",
          "Displayed data on maps for conference posters and a textbook by ArcGIS 9.2 and Adobe Illustrator CS3."
        ]
      }
    ],
    "honor": [
      {
        "name": "Geller Student Research Award",
        "organization": "Marsh Institute, Clark University",
        "time": "2011",
        "note": "USD 2250.00"
      },
      {
        "name": "Student Paper Award 1st Prize",
        "organization": "New England-Saint Lawrence Valley Geographical Society",
        "time": "2011",
        "note": ""
      },
      {
        "name": "IDCE Department Fellowship",
        "organization": "Clark University",
        "time": "2010",
        "note": "50% tuition remission"
      },
      {
        "name": "Presidential Award",
        "organization": "National Taiwan University",
        "time": "2006, 2007, 2008, 2009",
        "note": "Top 5% in department"
      },
      {
        "name": "Dean's Award",
        "organization": "National Taiwan University",
        "time": "2009",
        "note": "Top 10% in graduating class"
      }
    ],
    "presentation": [
      {
        "presentors": "Yang, C.-R.",
        "title": "Five Ways I Make Maps",
        "time": "April 2012",
        "event": "Clark Cartography and Geovisualization Talks",
        "location": "Worcester, MA"
      },
      {
        "presentors": "Yang, C.-R. and Xia, H.",
        "title": "Exploring the Association between Low Birth Weight and Exposure to Air Pollution in Massachusetts: Air Pollution Concentration Monitoring",
        "time": "April 2012",
        "event": "Clark Annual Graduate Student Council Multidisciplinary Conference",
        "location": "Worcester, MA"
      },
      {
        "presentors": "Yang, C.-R. and Xia, H.",
        "title": "Characterizing Factors Associated with Low Birth Weight in Massachusetts Using Geographically Weighted Logistic Regression",
        "time": "February 2012",
        "event": "The Spatial Analysis and Modeling (SAM) Specialty Group Student Paper Competition at The Association of American Geographers (AAG) Annual Meeting",
        "location": "New York, NY"
      },
      {
        "presentors": "Xin, H. and Yang, C.-R.",
        "title": "Using IDRISI to Predict Japan's Nuclear Fallout Dispersion in the Pacific Ocean",
        "time": "December 2011",
        "event": "International Symposium on Remote Sensing and GIS Methods for Change Detection and Spatio-temporal Modelling (CDSM)",
        "location": "Hong Kong SAR, China"
      },
      {
        "presentors": "Yang, C.-R.",
        "title": "Exploring the Association between Low Birth Weight and Exposure to Lead Using Geographically Weighted Odds Ratio",
        "time": "October 2011",
        "event": "New England - St Lawrence Valley Geographical Association (NESTVAL) Annual Conference",
        "location": "Montreal, QC, Canada"
      },
      {
        "presentors": "Xin, H. and Yang, C.-R.",
        "title": "GIS Our Waterways Using Open Source GIS to Develop Interactive Maps for Our Waterways",
        "time": "June 2011",
        "event": "Waterkeeper Alliance Annual Conference",
        "location": "Evanston, IL"
      }
    ]
  }
}